{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "TensorFlow.js Converter v4.21.0",
  "modelTopology": {
    "keras_version": "3.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_1",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_1",
              "batchInputShape": [
                null,
                7,
                11
              ]
            },
            "name": "input_layer_1",
            "inbound_nodes": []
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_4",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        7,
                        11
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "input_layer_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "training": false,
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_5",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_5",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        7,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "lstm_4",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "training": false,
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "lstm_5",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "RepeatVector",
            "config": {
              "name": "repeat_vector_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "n": 7
            },
            "name": "repeat_vector_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "dense_2",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_6",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        7,
                        32
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "repeat_vector_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "training": false,
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_7",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        7,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "lstm_6",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "training": false,
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "layer": {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                  "name": "dense_3",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "units": 11,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    128
                  ]
                }
              }
            },
            "name": "time_distributed_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        7,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "lstm_7",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          }
        ],
        "input_layers": [
          "input_layer_1",
          0,
          0
        ],
        "output_layers": [
          "time_distributed_1",
          0,
          0
        ]
      }
    },
    "training_config": {
      "loss": "mse",
      "loss_weights": null,
      "metrics": null,
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0005000000237487257,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_4/lstm_cell/kernel",
          "shape": [
            11,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_4/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_4/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/lstm_cell/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/lstm_cell/kernel",
          "shape": [
            32,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/lstm_cell/kernel",
          "shape": [
            64,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_1/dense_3/kernel",
          "shape": [
            128,
            11
          ],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_1/dense_3/bias",
          "shape": [
            11
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}